<template>
  <div class="about">
    <p class="learning-near__item"></p>
    <h2 class="learning-near__header">Домашнее задание</h2>

    <h5>Реализовать несколько форм и списков</h5>

    <h5>Цель: Научится создавать формы и работать с данными в приложении</h5>
    <h5>
      Какие скиллы тренируем в ДЗ: работа с формами, передача данных между
      компонентами
    </h5>

    <p style="text-align: left">
      1. Создать репозиторий на github<br />2. Сделать проект на vue с
      использованием vue-cli <br />3. Создать CRUD приложение для по типу
      книжный магазин. В приложении будет 2 типа сущностей: авторы и книги.<br />4.
      Сделать МР и прислать ссылку<br /><br />Реализовать страницы:<br />1.
      список книг<br />2. список авторов<br />3. добавление автора<br />4.
      добавление книги<br /><br />Формы:<br />1. добавления книг;<br />2.
      добавления авторов;<br />3. поиск книг по нескольким параметрам -
      название, год выпуска, категория, цена<br /><br />Прочий функционал:<br />1.
      кнопка удаления книг<br /><br />Модель автора включает: ФИО, ДР, пол,
      страну проживания, написанные книги, <br />Модель книги включает: ISBN,
      название, автор/список авторов, картинку, краткое описание, теги, цена,
      категория
    </p>
  </div>
</template>
